       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO-WORLD.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-GREETING        PIC X(20) VALUE "COBOL says hello!".

       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
           DISPLAY WS-GREETING.
           STOP RUN.
